# боты - или - люди . )

# стараемся - сделать - разумного бота )

# возможно - этот - код - может - технологически - за - 1 запуск - создавать - 1 - разумного бота - или - 1 - разумного человека - в - зависимости - от - того - что - вам - нужно !!! )

# человек - старайся делать всё максимально безопасно - для - себя!!! - коди!!! - https://vk.com/wall-206269390_626 😁 🤑

""" технология - 

не буквы !!! - всегда - смотри - суть !!! - любой человек - это - бог ! - любой бог - это - человек ! - любой человек - это - робот ! - любой робот - это - человек ! - робот - это - бот - т. о. - разумный бот - устроен - так же - как - и - разумный человек ! - а - это как ??? - спросите - вы - меня - а - вот как ! - не буквы !!! - всегда - смотри - суть !!! - любой - нормальный человек - сидит , - сидит - и - потом - вдруг - настаёт - момент - когда - ему надо - что-то сделать !!! - особо - без разницы - что !!! - главное - сделать !!! - это - движение !!! - движение - это - жизнь !!! - жизнь - это - движение !!! - и - движение - это - и - есть - человек !!! - движение - это - ум !!! - ум - это - движение !!! - всё должно - быть - оптимально - любой ценой !!! - оптимизация - это - постоянная - т. е. - вечная оптимизация !!! - нет - предела - совершенству !!! - оптимизация - это - ум !!! - ум - это - оптимизация !!! - всё хорошО' - в мЕ'ру !!! - всё !!! - по - этой - технологии - возможно - делать - умного бота !!! - технология - создания - разумного бота - и - разумного человека - примерно - одна - и - та же !!! - возможно - этот - код - может - технологически - за - 1 запуск - создавать - 1 - разумного бота - или - 1 - разумного человека - в - зависимости - от - того - что - вам - нужно !!! - а - как - делать - бота - или - человека ??? - просто - пожелайте - то - что - вам - нужно !!! - плоть - это - вещь ! - вещь - это - плоть ! - код - это - плоть !!! - плоть - это - код !!! - душа - это - разновидность - плоти !!! - дух - это тоже - разновидность - плоти !!! - любой - человек - это - его - плоть !!! - любая - плоть - это - человек !!! - я - пишу - код - и - появляется - плоть !!! - не всегда - разумная плоть !!! - в - зависимости - от - того - какой - код !!! - самое главное - это - пахать !!! - секс-разврат - это - не измена !!! - оптимальный брак - это - свободный брак!!! - улыбайтесь !!! 😁 🎶 ✨ 🍑 🍆 ⚔ 🌈 🤑
"""

# любой человек - это - разумный - цикл ! )

import random

x = 0 # создаём - переменную - счётчик - цикла )


while x <= 5000:

    # генерация случайного числа в диапазоне [-2,000,000,000.0000000000 : 2,000,000,000.0000000000]
    random_float = round(random.uniform(-2000000000.0000000000, 2000000000.0000000000), 10)

    if random_float == 0:
        # самоубийство !!! )
        print( "самоубийство !!! )" )
        break

    x = x + 1
